micropython/micropython/ports/psoc-edge/network_ifx_wcm.c
void network_init(void) {
    cy_rslt_t ret = cy_wcm_init(&wcm_config);
    wcm_assert_raise("network init error (code: %d)", ret);

    network_ap_init();
    network_sta_init();
}

void network_deinit(void) {
    cy_rslt_t ret = cy_wcm_deinit();
    wcm_assert_raise("network deinit error (code: %d)", ret);
}

// ---------------------------------------------------------------------------
// Minimal MicroPython type — make_new + print so the module registers cleanly
// ---------------------------------------------------------------------------

static mp_obj_t network_ifx_wcm_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 0, 1, false);

    if (n_args == 0 || mp_obj_get_int(args[0]) == MOD_NETWORK_STA_IF) {
        return MP_OBJ_FROM_PTR(&network_ifx_wcm_wl_sta);
    } else {
        return MP_OBJ_FROM_PTR(&network_ifx_wcm_wl_ap);
    }
}

static void network_ifx_wcm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    const char *status_str;
    if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
        if (cy_wcm_is_connected_to_ap()) {
            status_str = "joined";
        } else {
            status_str = "down";
        }
    } else {
        if (cy_wcm_is_ap_up()) {
            status_str = "up";
        } else {
            status_str = "down";
        }
    }

    cy_wcm_ip_address_t ip_address;
    cy_rslt_t ret = cy_wcm_get_ip_addr(self->itf, &ip_address);
    if (ret != CY_RSLT_SUCCESS) {
        ip_address.ip.v4 = 0;
    }

    mp_printf(print, "<IFX WCM %s %s %u.%u.%u.%u>",
        self->itf == CY_WCM_INTERFACE_TYPE_STA ? "STA" : "AP",
        status_str,
        ip_address.ip.v4 & 0xff,
        ip_address.ip.v4 >> 8 & 0xff,
        ip_address.ip.v4 >> 16 & 0xff,
        ip_address.ip.v4 >> 24
        );
}

/*******************************************************************************/
// network API

static mp_obj_t network_ifx_wcm_active(size_t n_args, const mp_obj_t *args) {
    cy_rslt_t ret = CY_RSLT_SUCCESS;
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
        if (n_args == 1) {
            return mp_obj_new_bool(cy_wcm_is_connected_to_ap());
        }
    } else if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
        if (n_args == 1) {
            return mp_obj_new_bool(cy_wcm_is_ap_up());
        } else {
            if (mp_obj_is_true(args[1])) {
                cy_wcm_ap_config_t *ap_conf = wcm_get_ap_conf_ptr(network_ifx_wcm_wl_ap);
                ret = cy_wcm_start_ap(ap_conf);
                wcm_assert_raise("network ap active error (with code: %d)", ret);
            } else {
                ret = cy_wcm_stop_ap();
                wcm_assert_raise("network ap deactivate error (with code: %d)", ret);
            }
        }
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_wcm_active_obj, 1, 2, network_ifx_wcm_active);

static mp_obj_t network_ifx_wcm_deinit(mp_obj_t self_in) {
    network_deinit();
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_wcm_deinit_obj, network_ifx_wcm_deinit);

typedef struct
{
    mp_obj_t *scan_list;
    cy_wcm_scan_status_t status;
}scan_user_data_t;

// Based on the scan result, get micropython defined equivalent security type (possible value 0-4, extended till 7 to include all cases) and security string (mapped to IFX stack)
uint8_t get_mpy_security_type(cy_wcm_security_t wcm_sec) {
    uint8_t mpy_sec_type = NET_IFX_WCM_SEC_UNKNOWN;

    switch (wcm_sec)
    {
        case CY_WCM_SECURITY_OPEN:
            mpy_sec_type = NET_IFX_WCM_SEC_OPEN;
            break;
        case CY_WCM_SECURITY_WEP_PSK:
        case CY_WCM_SECURITY_WEP_SHARED:
        case CY_WCM_SECURITY_IBSS_OPEN:
            mpy_sec_type = NET_IFX_WCM_SEC_WEP;
            break;
        case CY_WCM_SECURITY_WPA_AES_PSK:
        case CY_WCM_SECURITY_WPA_MIXED_PSK:
        case CY_WCM_SECURITY_WPA_TKIP_PSK:
        case CY_WCM_SECURITY_WPA_TKIP_ENT:
        case CY_WCM_SECURITY_WPA_AES_ENT:
        case CY_WCM_SECURITY_WPA_MIXED_ENT:
            mpy_sec_type = NET_IFX_WCM_SEC_WPA;
            break;
        case CY_WCM_SECURITY_WPA2_AES_PSK:
        case CY_WCM_SECURITY_WPA2_TKIP_PSK:
        case CY_WCM_SECURITY_WPA2_MIXED_PSK:
        case CY_WCM_SECURITY_WPA2_FBT_PSK:
        case CY_WCM_SECURITY_WPA2_TKIP_ENT:
        case CY_WCM_SECURITY_WPA2_AES_ENT:
        case CY_WCM_SECURITY_WPA2_MIXED_ENT:
        case CY_WCM_SECURITY_WPA2_FBT_ENT:
            mpy_sec_type = NET_IFX_WCM_SEC_WPA2;
            break;
        case CY_WCM_SECURITY_WPA2_WPA_AES_PSK:
        case CY_WCM_SECURITY_WPA2_WPA_MIXED_PSK:
            mpy_sec_type = NET_IFX_WCM_SEC_WPA_WPA2;
            break;
        case CY_WCM_SECURITY_WPA3_SAE:
        case CY_WCM_SECURITY_WPA3_WPA2_PSK:
            mpy_sec_type = NET_IFX_WCM_SEC_WPA3;
            break;
        case CY_WCM_SECURITY_WPS_SECURE:
        case CY_WCM_SECURITY_UNKNOWN:
        default:
            mpy_sec_type = NET_IFX_WCM_SEC_UNKNOWN;
            break;
    }
    return mpy_sec_type;
}

// Callback function for scan method. After each scan result, the scan callback is executed.
static void network_ifx_wcm_scan_cb(cy_wcm_scan_result_t *result_ptr, void *user_data, cy_wcm_scan_status_t status) {
    scan_user_data_t *scan_user_data = (scan_user_data_t *)user_data;
    mp_obj_t scan_list = MP_OBJ_FROM_PTR(scan_user_data->scan_list);
    uint8_t hidden_status = 1; // HIDDEN
    uint8_t security_type = NET_IFX_WCM_SEC_OPEN;

    if (status == CY_WCM_SCAN_INCOMPLETE) {
        // Get the network status : hidden(1) or open(0)
        if (strlen((const char *)result_ptr->SSID) != 0) {
            hidden_status = 0;
        }

        // Get security type as mapped in micropython function description
        security_type = get_mpy_security_type(result_ptr->security);

        mp_obj_t tuple[6] = {
            mp_obj_new_bytes(result_ptr->SSID, strlen((const char *)result_ptr->SSID)),
            mp_obj_new_bytes(result_ptr->BSSID, CY_WCM_MAC_ADDR_LEN),
            MP_OBJ_NEW_SMALL_INT(result_ptr->channel),
            MP_OBJ_NEW_SMALL_INT(result_ptr->signal_strength),
            MP_OBJ_NEW_SMALL_INT(security_type),
            MP_OBJ_NEW_SMALL_INT(hidden_status)
        };
        mp_obj_list_append(scan_list, mp_obj_new_tuple(6, tuple));
    }

