micropython/micropython/ports/psoc-edge/network_ifx_wcm.c
    scan_user_data->status = status;
}

static mp_obj_t network_ifx_wcm_scan(size_t n_args, const mp_obj_t *args, mp_map_t *kwargs) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    cy_rslt_t ret = CY_RSLT_SUCCESS;
    cy_wcm_scan_filter_t scan_filter;
    bool is_filter_used = false;

    if (self->itf != CY_WCM_INTERFACE_TYPE_STA) {
        mp_raise_ValueError(MP_ERROR_TEXT("network STA required"));
    }

    if (n_args != 1) {
        mp_raise_TypeError(MP_ERROR_TEXT("network scan accepts no query parameters"));
    }

    if (kwargs->used != 0) {
        if (kwargs->alloc != 1) {
            mp_raise_TypeError(MP_ERROR_TEXT("network scan only accepts one filter mode"));
        }

        is_filter_used = true;
        mp_map_elem_t *e = &kwargs->table[0];
        switch (mp_obj_str_get_qstr(e->key))
        {
            case MP_QSTR_ssid: {
                scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_SSID;
                size_t len;
                const char *ssid = mp_obj_str_get_data(e->value, &len);
                len = MIN(len, CY_WCM_MAX_SSID_LEN + 1);
                memcpy(scan_filter.param.SSID, ssid, len);
                memset(&scan_filter.param.SSID[len], 0, 1); // null terminated str.
                break;
            }

            case MP_QSTR_bssid: {
                scan_filter.mode = CY_WCM_SCAN_FILTER_TYPE_MAC;
                mp_buffer_info_t bssid;
                mp_get_buffer(e->value, &bssid, MP_BUFFER_READ);
                if (bssid.len != CY_WCM_MAC_ADDR_LEN) {
                    mp_raise_ValueError(MP_ERROR_TEXT("bssid address invalid length"));
                }
                memcpy(scan_filter.param.BSSID, bssid.buf, bssid.len);
                break;
            }

            default:
                mp_raise_ValueError(MP_ERROR_TEXT("unknown config param"));
        }
    }

    mp_obj_t network_list = mp_obj_new_list(0, NULL);
    scan_user_data_t scan_user_params;
    scan_user_params.scan_list = MP_OBJ_TO_PTR(network_list);
    scan_user_params.status = CY_WCM_SCAN_INCOMPLETE;

    cy_wcm_scan_filter_t *scan_filter_ptr = NULL;
    if (is_filter_used) {
        scan_filter_ptr = &scan_filter;
    }

    ret = cy_wcm_start_scan(network_ifx_wcm_scan_cb, (void *)&scan_user_params, scan_filter_ptr);
    wcm_assert_raise("network scan error (with code: %d)", ret);

    while (scan_user_params.status == CY_WCM_SCAN_INCOMPLETE /*|| TODO: timeout_expired */) {
    }

    return scan_user_params.scan_list;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_wcm_scan_obj, 1, network_ifx_wcm_scan);

static mp_obj_t network_ifx_wcm_connect(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);

    if (self->itf != CY_WCM_INTERFACE_TYPE_STA) {
        mp_raise_ValueError(MP_ERROR_TEXT("network STA required"));
    }

    enum { ARG_ssid, ARG_key, ARG_bssid };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_ssid,  MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_key,   MP_ARG_OBJ,                   {.u_rom_obj = MP_ROM_NONE} },
        { MP_QSTR_bssid, MP_ARG_KW_ONLY | MP_ARG_OBJ,  {.u_rom_obj = MP_ROM_NONE} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    cy_wcm_connect_params_t connect_param;
    cy_wcm_ip_address_t ip_address;
    memset(&connect_param, 0, sizeof(cy_wcm_connect_params_t));

    // SSID
    mp_buffer_info_t ssid;
    mp_get_buffer_raise(args[ARG_ssid].u_obj, &ssid, MP_BUFFER_READ);
    if (ssid.len > CY_WCM_MAX_SSID_LEN) {
        mp_raise_TypeError(MP_ERROR_TEXT("network connect SSID too long"));
    }
    memcpy(connect_param.ap_credentials.SSID, ssid.buf, ssid.len);

    // Key (optional)
    if (args[ARG_key].u_obj != mp_const_none) {
        mp_buffer_info_t key;
        mp_get_buffer_raise(args[ARG_key].u_obj, &key, MP_BUFFER_READ);
        if (key.len > CY_WCM_MAX_PASSPHRASE_LEN) {
            mp_raise_TypeError(MP_ERROR_TEXT("network connect key too long"));
        }
        memcpy(connect_param.ap_credentials.password, key.buf, key.len);
    }

    // BSSID (optional)
    if (args[ARG_bssid].u_obj != mp_const_none) {
        mp_buffer_info_t bssid;
        mp_get_buffer_raise(args[ARG_bssid].u_obj, &bssid, MP_BUFFER_READ);
        if (bssid.len != CY_WCM_MAC_ADDR_LEN) {
            mp_raise_ValueError(MP_ERROR_TEXT("bssid address invalid length"));
        }
        memcpy(connect_param.BSSID, bssid.buf, bssid.len);
    }

    // Let WCM discover security type
    connect_param.ap_credentials.security = CY_WCM_SECURITY_UNKNOWN;

    network_ifx_wcm_sta_obj_t *sta_conf = wcm_get_sta_conf_ptr(network_ifx_wcm_wl_sta);
    uint8_t retries = sta_conf->connect_retries;
    cy_rslt_t ret;
    do {
        ret = cy_wcm_connect_ap(&connect_param, &ip_address);
    } while (ret != CY_RSLT_SUCCESS && --retries > 0);
    wcm_assert_raise("network sta connect error (with code: %d)", ret);

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_wcm_connect_obj, 1, network_ifx_wcm_connect);

static mp_obj_t network_ifx_wcm_disconnect(mp_obj_t self_in) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->itf != CY_WCM_INTERFACE_TYPE_STA) {
        mp_raise_ValueError(MP_ERROR_TEXT("network STA required"));
    }
    cy_rslt_t ret = cy_wcm_disconnect_ap();
    wcm_assert_raise("network sta disconnect error (with code: %d)", ret);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_wcm_disconnect_obj, network_ifx_wcm_disconnect);

static mp_obj_t network_ifx_wcm_isconnected(mp_obj_t self_in) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
        return mp_obj_new_bool(cy_wcm_is_connected_to_ap());
    } else if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
        // Return False immediately if AP is not running
        if (!cy_wcm_is_ap_up()) {
            return mp_obj_new_bool(false);
        }
        // True if at least one client is associated
        bool is_a_sta_connected = false;
        cy_wcm_mac_t sta[1] = {0};
        cy_wcm_mac_t not_conn_sta = {0, 0, 0, 0, 0, 0};
        cy_rslt_t ret = cy_wcm_get_associated_client_list(sta, 1);
        wcm_assert_raise("network ap isconnected error (with code: %d)", ret);
        if (memcmp(&sta[0], &not_conn_sta, CY_WCM_MAC_ADDR_LEN) != 0) {
            is_a_sta_connected = true;
        }
        return mp_obj_new_bool(is_a_sta_connected);
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(network_ifx_wcm_isconnected_obj, network_ifx_wcm_isconnected);

static mp_obj_t network_ifx_wcm_status(size_t n_args, const mp_obj_t *args) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (n_args != 2) {
        mp_raise_TypeError(MP_ERROR_TEXT("network status expects 1 argument"));
    }

    qstr query = mp_obj_str_get_qstr(args[1]);

    if (query == MP_QSTR_rssi) {
        if (self->itf != CY_WCM_INTERFACE_TYPE_STA) {
            mp_raise_ValueError(MP_ERROR_TEXT("network station required"));
        }
        cy_wcm_associated_ap_info_t ap_info;
        cy_rslt_t ret = cy_wcm_get_associated_ap_info(&ap_info);
        wcm_assert_raise("network status error (with code: %d)", ret);
        return mp_obj_new_int(ap_info.signal_strength);
    } else if (query == MP_QSTR_stations) {
        if (self->itf != CY_WCM_INTERFACE_TYPE_AP) {
            mp_raise_ValueError(MP_ERROR_TEXT("network access point required"));
        }

        cy_wcm_mac_t sta_list[NETWORK_WLAN_MAX_AP_STATIONS];
        cy_wcm_mac_t not_conn_sta = {0, 0, 0, 0, 0, 0};

        cy_rslt_t ret = cy_wcm_get_associated_client_list(&sta_list[0], NETWORK_WLAN_MAX_AP_STATIONS);
        wcm_assert_raise("network status error (with code: %d)", ret);

