micropython/micropython/ports/psoc-edge/network_ifx_wcm.c
static mp_obj_t network_ifx_wcm_config(size_t n_args, const mp_obj_t *args, mp_map_t *kwargs) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (kwargs->used == 0) {
        // Get config value
        if (n_args != 2) {
            mp_raise_TypeError(MP_ERROR_TEXT("must query one param"));
        }

        if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
            cy_wcm_ap_config_t *ap_conf = wcm_get_ap_conf_ptr(network_ifx_wcm_wl_ap);
            return network_ap_get_config_param(ap_conf, mp_obj_str_get_qstr(args[1]));
        } else if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
            network_ifx_wcm_sta_obj_t *sta_conf = wcm_get_sta_conf_ptr(network_ifx_wcm_wl_sta);
            return network_sta_get_config_param(sta_conf, mp_obj_str_get_qstr(args[1]));
        }
    } else {
        // Set config value(s)
        if (n_args != 1) {
            mp_raise_TypeError(MP_ERROR_TEXT("can't specify pos and kw args"));
        }
        size_t kwargs_num = kwargs->used;
        size_t matched = 0;
        for (size_t i = 0; i < kwargs->alloc; ++i) {
            if (MP_MAP_SLOT_IS_FILLED(kwargs, i)) {
                matched++;
                mp_map_elem_t *e = &kwargs->table[i];
                bool hold_config = (matched < kwargs_num);

                if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
                    cy_wcm_ap_config_t *ap_conf = wcm_get_ap_conf_ptr(network_ifx_wcm_wl_ap);
                    network_ap_set_config_param(ap_conf, mp_obj_str_get_qstr(e->key), e->value, hold_config);
                } else if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
                    network_ifx_wcm_sta_obj_t *sta_conf = wcm_get_sta_conf_ptr(network_ifx_wcm_wl_sta);
                    network_sta_set_config_param(sta_conf, mp_obj_str_get_qstr(e->key), e->value);
                }
            }
        }
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(network_ifx_wcm_config_obj, 1, network_ifx_wcm_config);

static mp_obj_t network_ifx_wcm_ifconfig(size_t n_args, const mp_obj_t *args) {
    network_ifx_wcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    if (n_args == 1) {
        const ip_addr_t *dns = dns_getserver(0);
        cy_wcm_ip_address_t ip_address;
        cy_wcm_ip_address_t net_mask_addr;
        cy_wcm_ip_address_t gateway_addr;
        cy_rslt_t ret = cy_wcm_get_ip_addr(self->itf, &ip_address);
        wcm_assert_raise("network ifconfig error (with code: %d)", ret);
        ret = cy_wcm_get_gateway_ip_address(self->itf, &gateway_addr);
        wcm_assert_raise("network ifconfig error (with code: %d)", ret);
        ret = cy_wcm_get_ip_netmask(self->itf, &net_mask_addr);
        wcm_assert_raise("network ifconfig error (with code: %d)", ret);
        mp_obj_t tuple[4] = {
            mp_obj_new_str(ip4addr_ntoa((const ip4_addr_t *)&ip_address.ip.v4), strlen(ip4addr_ntoa((const ip4_addr_t *)&ip_address.ip.v4))),
            mp_obj_new_str(ip4addr_ntoa((const ip4_addr_t *)&net_mask_addr.ip.v4), strlen(ip4addr_ntoa((const ip4_addr_t *)&net_mask_addr.ip.v4))),
            mp_obj_new_str(ip4addr_ntoa((const ip4_addr_t *)&gateway_addr.ip.v4), strlen(ip4addr_ntoa((const ip4_addr_t *)&gateway_addr.ip.v4))),
            netutils_format_ipv4_addr((uint8_t *)dns, NETUTILS_BIG),
        };
        return mp_obj_new_tuple(4, tuple);
    } else {
        if (self->itf == CY_WCM_INTERFACE_TYPE_AP) {
            const mp_obj_t *argss = args + 1;
            mp_obj_t *items;
            mp_obj_get_array_fixed_n(argss[0], 4, &items);
            const char *ip_address = mp_obj_str_get_str(items[0]);
            const char *net_mask_addr = mp_obj_str_get_str(items[1]);
            const char *gateway_addr = mp_obj_str_get_str(items[2]);
            cy_wcm_ap_config_t *ap_conf = wcm_get_ap_conf_ptr(network_ifx_wcm_wl_ap);
            cy_rslt_t ret = cy_wcm_set_ap_ip_setting(&(ap_conf->ip_settings), ip_address, net_mask_addr, gateway_addr, CY_WCM_IP_VER_V4);
            wcm_assert_raise("network ifconfig error (with code: %d)", ret);

            ip_addr_t dns;
            netutils_parse_ipv4_addr(items[3], (uint8_t *)&dns, NETUTILS_BIG);
            dns_setserver(0, &dns);

            restart_ap(ap_conf);
        } else if (self->itf == CY_WCM_INTERFACE_TYPE_STA) {
            mp_raise_ValueError(MP_ERROR_TEXT("network access point required"));
        }
    }

    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(network_ifx_wcm_ifconfig_obj, 1, 2, network_ifx_wcm_ifconfig);


static const mp_rom_map_elem_t network_ifx_wcm_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_deinit),      MP_ROM_PTR(&network_ifx_wcm_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_active),      MP_ROM_PTR(&network_ifx_wcm_active_obj) },
    { MP_ROM_QSTR(MP_QSTR_scan),        MP_ROM_PTR(&network_ifx_wcm_scan_obj) },
    { MP_ROM_QSTR(MP_QSTR_connect),     MP_ROM_PTR(&network_ifx_wcm_connect_obj) },
    { MP_ROM_QSTR(MP_QSTR_disconnect),  MP_ROM_PTR(&network_ifx_wcm_disconnect_obj) },
    { MP_ROM_QSTR(MP_QSTR_isconnected), MP_ROM_PTR(&network_ifx_wcm_isconnected_obj) },
    { MP_ROM_QSTR(MP_QSTR_status),      MP_ROM_PTR(&network_ifx_wcm_status_obj) },
    { MP_ROM_QSTR(MP_QSTR_config),      MP_ROM_PTR(&network_ifx_wcm_config_obj) },
    { MP_ROM_QSTR(MP_QSTR_ifconfig),    MP_ROM_PTR(&network_ifx_wcm_ifconfig_obj) },

    // Network WCM constants
    // Security modes
    { MP_ROM_QSTR(MP_QSTR_OPEN), MP_ROM_INT(NET_IFX_WCM_SEC_OPEN) },
    { MP_ROM_QSTR(MP_QSTR_WEP), MP_ROM_INT(NET_IFX_WCM_SEC_WEP) },
    { MP_ROM_QSTR(MP_QSTR_WPA), MP_ROM_INT(NET_IFX_WCM_SEC_WPA) },
    { MP_ROM_QSTR(MP_QSTR_WPA2), MP_ROM_INT(NET_IFX_WCM_SEC_WPA2) },
    { MP_ROM_QSTR(MP_QSTR_WPA3), MP_ROM_INT(NET_IFX_WCM_SEC_WPA3) },
    { MP_ROM_QSTR(MP_QSTR_WPA2_WPA_PSK), MP_ROM_INT(NET_IFX_WCM_SEC_WPA_WPA2) },
    { MP_ROM_QSTR(MP_QSTR_SEC_UNKNOWN), MP_ROM_INT(NET_IFX_WCM_SEC_UNKNOWN) },
};
static MP_DEFINE_CONST_DICT(network_ifx_wcm_locals_dict, network_ifx_wcm_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    mp_network_ifx_wcm_type,
    MP_QSTR_IFX_WCM,
    MP_TYPE_FLAG_NONE,
    make_new, network_ifx_wcm_make_new,
    print, network_ifx_wcm_print,
    locals_dict, &network_ifx_wcm_locals_dict
    );

#endif // MICROPY_PY_NETWORK_IFX_WCM
